package COLLECTION;

public class BigONotation {
    public static void main(String[] args) {

        /**
         * O(n) - сложность порядка n. Также данный тип называют линейным.
         * Тем больше становится элементов в нашей коллекции, тем больше нужно шагов для операции.
         *
         * O(1) - сложность порядка один. Самый эффективный и быстрый алгоритм
         *
         * O(logn) - логарифмическая сложность. По скорости хуже чем чем O(1), но лучше чем O(n)
         *
         */





    }
}
